<?php

return [
    '1.0.0' => [
        'Initialize extension.',
    ],
    '1.1.0' => [
        '增加文件直传表单组件',
        'create_weiwait_uploads_table.php',
        'create_filesystem_configs_table.php',
    ],
    '1.1.1' => [
        '一些优化'
    ],
    '1.1.2' => [
        '增加表单必填(required)'
    ],
    '1.1.3' => [
        '修复编辑预览'
    ],
    '1.1.4' => [
        '修复样式完整性'
    ],
    '1.2.0' => [
        '新增(覆盖)tags表单组件'
    ],
    '2.0.0' => [
        '放弃使用覆盖原生组件的方式',
        '修复内嵌表单',
        '排除扩展路由权限',
        '一些优化',
    ],
    '2.0.1' => [
        '修复文件删除',
    ],
    '2.1.0' => [
        '新增list表单组件',
        '新增keyValue表单组件',
    ],
    '2.1.1' => [
        '优化keyValue回显'
    ],
    '2.1.2' => [
        '优化配置注入'
    ],
    '2.2.0' => [
        '一些优化',
        '新增行政区划选择',
        'create_china_areas_table.php',
        'ChinaAreaTableSeeder.php',
    ],
    '2.3.0' => [
        '一些优化',
        '新增选择组件',
    ],
    '2.3.1' => [
        '一些优化',
    ],
    '2.3.2' => [
        '一些优化',
    ],
    '2.4.0' => [
        '一些优化',
        '新增多选组件',
    ],
    '2.5.0' => [
        '一些优化',
        'drop_filesystem_configs_table.php',
    ],
    '2.5.1' => [
        '一些优化',
    ],
];
